# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters

nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# activation: nn.ReLU()
scale: 'n'
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2  对输入进行一次卷积，输出64个特征通道，卷积核大小为3x3，步长为2。
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)


#                  from  n    params  module                                       arguments (1)[ch_in, ch_out, kernel, stride]       h, w, c
#  0                  -1  1       464  ultralytics.nn.modules.conv.Conv             [3, 16, 3, 2]                              640 x 640 x 16
#  1                  -1  1      4672  ultralytics.nn.modules.conv.Conv             [16, 32, 3, 2]                             320 x 320 x 32
#  2                  -1  1      7360  ultralytics.nn.modules.block.C2f             [32, 32, 1, True]                           160 x 160 x 32
#  3                  -1  1     18560  ultralytics.nn.modules.conv.Conv             [32, 64, 3, 2]                             160 x 160 x 64
#  4                  -1  2     49664  ultralytics.nn.modules.block.C2f             [64, 64, 2, True]                           80 x 80 x 64
#  5                  -1  1     73984  ultralytics.nn.modules.conv.Conv             [64, 128, 3, 2]                            80 x 80 x 128
#  6                  -1  2    197632  ultralytics.nn.modules.block.C2f             [128, 128, 2, True]                         40 x 40 x 128
#  7                  -1  1    295424  ultralytics.nn.modules.conv.Conv             [128, 256, 3, 2]                           40 x 40 x 256
#  8                  -1  1    460288  ultralytics.nn.modules.block.C2f             [256, 256, 1, True]                         20 x 20 x 256
#  9                  -1  1    164608  ultralytics.nn.modules.block.SPPF            [256, 256, 5]                               20 x 20 x 256

# head
# 10                  -1  1         0  torch.nn.modules.upsampling.Upsample         [None, 2, 'nearest']                        40 x 40 x 256
# 11             [-1, 6]  1         0  ultralytics.nn.modules.conv.Concat           [1]                                         40 x 40 x 384
# 12                  -1  1    148224  ultralytics.nn.modules.block.C2f             [384, 128, 1]                               40 x 40 x 128
# 13                  -1  1         0  torch.nn.modules.upsampling.Upsample         [None, 2, 'nearest']                        80 x 80 x 128
# 14             [-1, 4]  1         0  ultralytics.nn.modules.conv.Concat           [1]                                         80 x 80 x 192
# 15                  -1  1     37248  ultralytics.nn.modules.block.C2f             [192, 64, 1]                                80 x 80 x 64
# 16                  -1  1     36992  ultralytics.nn.modules.conv.Conv             [64, 64, 3, 2]                             40 x 40 x 64
# 17            [-1, 12]  1         0  ultralytics.nn.modules.conv.Concat           [1]                                         40 x 40 x 192
# 18                  -1  1    123648  ultralytics.nn.modules.block.C2f             [192, 128, 1]                               40 x 40 x 128
# 19                  -1  1    147712  ultralytics.nn.modules.conv.Conv             [128, 128, 3, 2]                           20 x 20 x 128
# 20             [-1, 9]  1         0  ultralytics.nn.modules.conv.Concat           [1]                                         20 x 20 x 384
# 21                  -1  1    493056  ultralytics.nn.modules.block.C2f             [384, 256, 1]                               20 x 20 x 256
# 22        [15, 18, 21]  1    430867  ultralytics.nn.modules.head.Detect           [1, [64, 128, 256]]                         检测结果